tdxguiping/ESP32_S3_epaper/main/server_network_sta/wifi_work_time/server_network_sta_wifi_work_time.c
        ESP_LOGI(TAG,
                 "slideshow enabled before power off, wake timer on interval=%lu saved_interval=%lu elapsed=%lu startup_delay=%lu extra_advance=%lu wake_advance=%lu random=%d",
                 (unsigned long)wake_interval,
                 (unsigned long)interval,
                 (unsigned long)runtime_elapsed,
                 (unsigned long)startup_delay,
                 (unsigned long)TDX_SLIDESHOW_WAKE_EXTRA_ADVANCE_SECONDS,
                 (unsigned long)wake_advance,
                 random ? 1 : 0);
        wake_ret = ch583_wifi_uart_send_wake_timer_on(wake_interval);
        wake_timer_on = wake_ret >= 0;
    } else {
        ESP_LOGI(TAG, "slideshow disabled before power off, wake timer off");
        wake_ret = ch583_wifi_uart_send_wake_timer_off();
    }

    if (wake_ret < 0) {
        ESP_LOGW(TAG, "CH583 wake timer config failed ret=%d, continue power off", wake_ret);
    } else if (wake_timer_on) {
        // Roll back this timer if the current power-off attempt is canceled later.
        (void)__atomic_fetch_or(&s_runtime_state_flags,
                                USER_WORK_STATE_RUNTIME_WAKE_TIMER_CANCEL_PENDING_BIT,
                                __ATOMIC_ACQ_REL);
    } else {
        (void)__atomic_fetch_and(&s_runtime_state_flags,
                                 ~USER_WORK_STATE_RUNTIME_WAKE_TIMER_CANCEL_PENDING_BIT,
                                 __ATOMIC_ACQ_REL);
    }
    return true;
}

static bool retry_pending_wake_timer_cancel(void)
{
    uint32_t runtime_flags = __atomic_load_n(&s_runtime_state_flags, __ATOMIC_ACQUIRE);
    if ((runtime_flags & USER_WORK_STATE_RUNTIME_WAKE_TIMER_CANCEL_PENDING_BIT) == 0) {
        return true;
    }

    // Keep rollback traffic separated from the preceding CH583 shutdown command.
    vTaskDelay(pdMS_TO_TICKS(100));
    int cancel_ret = ch583_wifi_uart_send_wake_timer_off();
    if (cancel_ret < 0) {
        return false;
    }

    (void)__atomic_fetch_and(&s_runtime_state_flags,
                             ~USER_WORK_STATE_RUNTIME_WAKE_TIMER_CANCEL_PENDING_BIT,
                             __ATOMIC_ACQ_REL);
    ESP_LOGI(TAG, "pending CH583 wake timer cancellation completed");
    return true;
}

static bool retry_pending_led_power_off_cancel(void)
{
    uint32_t runtime_flags = __atomic_load_n(&s_runtime_state_flags, __ATOMIC_ACQUIRE);
    if ((runtime_flags & USER_WORK_STATE_RUNTIME_LED_CANCEL_PENDING_BIT) == 0) {
        return true;
    }

    esp_err_t cancel_ret = UserLedStatus_CancelPowerOffSync();
    if (cancel_ret != ESP_OK) {
        return false;
    }

    (void)__atomic_fetch_and(&s_runtime_state_flags,
                             ~USER_WORK_STATE_RUNTIME_LED_CANCEL_PENDING_BIT,
                             __ATOMIC_ACQ_REL);
    UserLedStatus_SetPowerOffPending(false);
    ESP_LOGI(TAG, "pending LED power-off cancellation completed");
    return true;
}

static void work_state_task(void *arg)
{
    uint8_t counter = 0;
    uint8_t slideshow_debug_counter = 0;
#if CH583_WIFI_NFC_TEST_ENABLE
    bool nfc_test_done = false;
#endif
    (void)arg;

    while (true) {
        bool led_cancel_done = retry_pending_led_power_off_cancel();
        bool wake_timer_cancel_done = retry_pending_wake_timer_cancel();
        if (!led_cancel_done || !wake_timer_cancel_done) {
            vTaskDelay(pdMS_TO_TICKS(USER_WORK_STATE_TASK_INTERVAL_MS));
            continue;
        }

        uint32_t runtime_flags = __atomic_load_n(&s_runtime_state_flags, __ATOMIC_ACQUIRE);
        if ((runtime_flags & USER_WORK_STATE_RUNTIME_CH583_STARTUP_PENDING_BIT) != 0) {
            vTaskDelay(pdMS_TO_TICKS(USER_WORK_STATE_TASK_INTERVAL_MS));
            continue;
        }

        if (__atomic_load_n(&s_factory_reset_guard_active, __ATOMIC_ACQUIRE)) {
            vTaskDelay(pdMS_TO_TICKS(USER_WORK_STATE_TASK_INTERVAL_MS));
            continue;
        }
        uint32_t factory_reset_wake_seconds =
            __atomic_load_n(&s_factory_reset_wake_seconds, __ATOMIC_ACQUIRE);
        bool factory_reset_power_cycle_pending = factory_reset_wake_seconds > 0;
        uint32_t elapsed = update_working_time_seconds();
        uint8_t one_shot_state =
            __atomic_load_n(&s_one_shot_power_off_state, __ATOMIC_ACQUIRE);
        bool one_shot_active =
            (one_shot_state & USER_WORK_STATE_ONE_SHOT_ACTIVE_BIT) != 0;
        uint32_t clamped_continue_time = one_shot_active ?
                                         server_required_continue_work_time :
                                         clamp_continue_seconds(server_required_continue_work_time);
        if (!one_shot_active &&
            clamped_continue_time != server_required_continue_work_time) {
            server_required_continue_work_time = clamped_continue_time;
            (void)save_work_state_to_nvs();
            (void)save_work_time_vars_to_app_nvs();
        }

        uint32_t remaining = server_required_continue_work_time > elapsed ?
                             server_required_continue_work_time - elapsed :
                             0;

#if CH583_WIFI_NFC_TEST_ENABLE
        if (!nfc_test_done && elapsed >= CH583_WIFI_NFC_TEST_START_DELAY_SECONDS) {
            nfc_test_done = ch583_wifi_uart_test_nfc_step();
        }
#endif


        counter++;
        if(counter >30)
        {
         counter = 0;
         ESP_LOGI(TAG, "work_state status elapsed=%lu target=%lu remaining=%lu standby=%lu",
                 (unsigned long)elapsed,
                 (unsigned long)server_required_continue_work_time,
                 (unsigned long)remaining,
                 (unsigned long)wifi_standby_time_s);
        }

        uint32_t slideshow_interval = 0;
        uint32_t slideshow_elapsed = 0;
        uint32_t slideshow_rtc_remain = 0;
        int64_t slideshow_now_epoch = 0;
        int64_t slideshow_next_epoch = 0;
        bool slideshow_running = false;
        if (ServerNetworkStaSlideshow_GetScheduleTiming(&slideshow_interval,
                                                        &slideshow_now_epoch,
                                                        &slideshow_next_epoch,
                                                        &slideshow_rtc_remain,
                                                        &slideshow_running) &&
            slideshow_running) {
            slideshow_debug_counter++;
            if (slideshow_debug_counter >= 10 || slideshow_rtc_remain <= 3) {
                slideshow_debug_counter = 0;
                char now_text[32] = {0};
                char next_text[32] = {0};
                format_epoch_local(slideshow_now_epoch, now_text, sizeof(now_text));
                format_epoch_local(slideshow_next_epoch, next_text, sizeof(next_text));
                ESP_LOGI(TAG,
                         "slide_timer rtc active=1 interval=%lu now=%lld(%s) next=%lld(%s) remain=%lu epd=%s",
                         (unsigned long)slideshow_interval,
                         (long long)slideshow_now_epoch,
                         now_text,
                         (long long)slideshow_next_epoch,
                         next_text,
                         (unsigned long)slideshow_rtc_remain,
                         ServerNetworkStaEpdDisplay_IsBusy() ? "BUSY" : "IDLE");
            }
        } else if (ServerNetworkStaSlideshow_GetRuntimeTiming(&slideshow_interval,
                                                              &slideshow_elapsed,
                                                              &slideshow_running) &&
                   slideshow_running) {
            slideshow_debug_counter++;
            uint32_t slideshow_remaining = slideshow_interval > slideshow_elapsed ?
                                           slideshow_interval - slideshow_elapsed :
                                           0;
            if (slideshow_debug_counter >= 10 || slideshow_remaining <= 3) {
                slideshow_debug_counter = 0;
                ESP_LOGI(TAG,
                         "slide_timer legacy_tick active=1 interval=%lu elapsed=%lu remain=%lu epd=%s",
                         (unsigned long)slideshow_interval,
                         (unsigned long)slideshow_elapsed,
                         (unsigned long)slideshow_remaining,
                         ServerNetworkStaEpdDisplay_IsBusy() ? "BUSY" : "IDLE");
            }
        } else {
            slideshow_debug_counter = 0;
        }

        if (factory_reset_power_cycle_pending ||
            elapsed > server_required_continue_work_time) {
            uint32_t ota_hold_flags = __atomic_load_n(&s_ota_hold_flags, __ATOMIC_ACQUIRE);
            if (ota_hold_flags != 0) {
                if (counter == 0) {
                    ESP_LOGI(TAG,
                             "working_time timeout ignored during OTA elapsed=%lu target=%lu standby=%lu hold=0x%lx",
                             (unsigned long)elapsed,
                             (unsigned long)server_required_continue_work_time,
                             (unsigned long)wifi_standby_time_s,
                             (unsigned long)ota_hold_flags);
                }
            } else {
                TickType_t now = xTaskGetTickCount();
                TickType_t retry_interval_ticks = pdMS_TO_TICKS(20000);
                uint32_t wifi_connect_guard_remaining_ms =
                    ServerNetworkStaWifiWorkTime_GetWifiConnectGuardRemainingMs();
                if (wifi_connect_guard_remaining_ms > 0) {
                    uint32_t old_log_flags =
                        __atomic_fetch_or(&s_guard_log_flags,
                                          USER_WORK_STATE_GUARD_LOG_WIFI_CONNECT_BIT,
                                          __ATOMIC_ACQ_REL);
                    if ((old_log_flags &
                         USER_WORK_STATE_GUARD_LOG_WIFI_CONNECT_BIT) == 0) {
                        ESP_LOGI(TAG,
                                 "power off postponed by WiFi connect guard remaining_ms=%lu",
                                 (unsigned long)wifi_connect_guard_remaining_ms);
                    }
                    vTaskDelay(pdMS_TO_TICKS(USER_WORK_STATE_TASK_INTERVAL_MS));
                    continue;
                }
                (void)__atomic_fetch_and(
                    &s_guard_log_flags,
                    ~USER_WORK_STATE_GUARD_LOG_WIFI_CONNECT_BIT,
                    __ATOMIC_ACQ_REL);
                if (ServerNetworkStaEpdDisplay_IsBusy()) {
                    if (counter == 0) {
                        ESP_LOGI(TAG,
                                 "working_time timeout postponed because EPD busy elapsed=%lu target=%lu standby=%lu",
                                 (unsigned long)elapsed,
                                 (unsigned long)server_required_continue_work_time,
                                 (unsigned long)wifi_standby_time_s);
                    }
                    vTaskDelay(pdMS_TO_TICKS(USER_WORK_STATE_TASK_INTERVAL_MS));
                    continue;
                }
                if (ServerNetworkStaWifiWorkTime_IsImageSaveInProgress()) {
                    if (counter == 0) {
                        ESP_LOGI(TAG,
                                 "power off postponed because image save busy elapsed=%lu target=%lu standby=%lu",
                                 (unsigned long)elapsed,
                                 (unsigned long)server_required_continue_work_time,
                                 (unsigned long)wifi_standby_time_s);
                    }
                    vTaskDelay(pdMS_TO_TICKS(USER_WORK_STATE_TASK_INTERVAL_MS));
                    continue;
                }
                if (ServerNetworkStaWifiWorkTime_IsDailyImageInProgress()) {
                    if (counter == 0) {
                        ESP_LOGI(TAG,
                                 "power off postponed because daily image busy elapsed=%lu target=%lu",
                                 (unsigned long)elapsed,
                                 (unsigned long)server_required_continue_work_time);
                    }
                    vTaskDelay(pdMS_TO_TICKS(USER_WORK_STATE_TASK_INTERVAL_MS));
                    continue;
                }
                uint32_t http_hold_remaining =
                    factory_reset_power_cycle_pending ? 0 :
                    http_activity_hold_remaining_seconds(now);
                if (http_hold_remaining > 0) {
                    uint32_t old_log_flags = __atomic_fetch_or(&s_guard_log_flags,
                                                               USER_WORK_STATE_GUARD_LOG_HTTP_BIT,
                                                               __ATOMIC_ACQ_REL);
                    if ((old_log_flags & USER_WORK_STATE_GUARD_LOG_HTTP_BIT) == 0) {
                        ESP_LOGI(TAG,
                                 "power off postponed by HTTP activity remaining=%lu elapsed=%lu target=%lu",
                                 (unsigned long)http_hold_remaining,
                                 (unsigned long)elapsed,
                                 (unsigned long)server_required_continue_work_time);
                    }
                    vTaskDelay(pdMS_TO_TICKS(USER_WORK_STATE_TASK_INTERVAL_MS));
                    continue;
                }
                (void)__atomic_fetch_and(&s_guard_log_flags,
                                         ~USER_WORK_STATE_GUARD_LOG_HTTP_BIT,
                                         __ATOMIC_ACQ_REL);
                uint32_t ch583_hold_remaining =
                    factory_reset_power_cycle_pending ? 0 :
                    ch583_activity_hold_remaining_seconds(now);
                if (ch583_hold_remaining > 0) {
                    uint32_t old_log_flags = __atomic_fetch_or(&s_guard_log_flags,
                                                               USER_WORK_STATE_GUARD_LOG_CH583_BIT,
                                                               __ATOMIC_ACQ_REL);
                    if ((old_log_flags & USER_WORK_STATE_GUARD_LOG_CH583_BIT) == 0) {
                        ESP_LOGI(TAG,
                                 "power off postponed by CH583 activity remaining=%lu elapsed=%lu target=%lu",
                                 (unsigned long)ch583_hold_remaining,
                                 (unsigned long)elapsed,
                                 (unsigned long)server_required_continue_work_time);
                    }
                    vTaskDelay(pdMS_TO_TICKS(USER_WORK_STATE_TASK_INTERVAL_MS));
                    continue;
                }
                (void)__atomic_fetch_and(&s_guard_log_flags,
                                         ~USER_WORK_STATE_GUARD_LOG_CH583_BIT,
                                         __ATOMIC_ACQ_REL);
                if (!factory_reset_power_cycle_pending &&
                    s_last_power_off_send_tick != 0 &&
                    (now - s_last_power_off_send_tick) < retry_interval_ticks) {
                    vTaskDelay(pdMS_TO_TICKS(USER_WORK_STATE_TASK_INTERVAL_MS));
                    continue;
                }
                s_last_power_off_send_tick = now;

                if (!factory_reset_power_cycle_pending &&
                    should_skip_or_cancel_one_shot_power_off()) {
                    vTaskDelay(pdMS_TO_TICKS(USER_WORK_STATE_TASK_INTERVAL_MS));
                    continue;
                }
                if (factory_reset_power_cycle_pending) {
                    ESP_LOGW(TAG,
                             "factory reset complete, evaluate CH583 power cycle wake_seconds=%lu",
                             (unsigned long)factory_reset_wake_seconds);
                } else {
                    ESP_LOGI(TAG,
                             "working_time timeout, evaluate CH583 power off elapsed=%lu target=%lu standby=%lu",
                             (unsigned long)elapsed,
                             (unsigned long)server_required_continue_work_time,
                             (unsigned long)wifi_standby_time_s);
                }
                bool slideshow_enabled_before_power_off = false;
                if (!configure_ch583_wake_timer_before_power_off(
                        &slideshow_enabled_before_power_off,
                        factory_reset_power_cycle_pending ?
                            factory_reset_wake_seconds : 0)) {
                    s_last_power_off_send_tick = 0;
                    vTaskDelay(pdMS_TO_TICKS(USER_WORK_STATE_TASK_INTERVAL_MS));
                    continue;
                }
                UserLedStatus_SetPowerOffPending(true);
                vTaskDelay(pdMS_TO_TICKS(100));
                esp_err_t led_ret = UserLedStatus_PreparePowerOffSync();
                if (led_ret != ESP_OK) {
                    UserLedStatus_SetPowerOffPending(false);
                    ESP_LOGE(TAG, "power off postponed because LED shutdown failed ret=%s",
                             esp_err_to_name(led_ret));
                    if (!retry_pending_wake_timer_cancel()) {
                        ESP_LOGE(TAG, "LED shutdown failure left CH583 wake timer rollback pending");
                    }
                    vTaskDelay(pdMS_TO_TICKS(USER_WORK_STATE_TASK_INTERVAL_MS));
                    continue;
                }
                vTaskDelay(pdMS_TO_TICKS(100));
                uint32_t final_ota_hold_flags = __atomic_load_n(&s_ota_hold_flags, __ATOMIC_ACQUIRE);
                bool final_epd_busy = ServerNetworkStaEpdDisplay_IsBusy();
                bool final_image_save_busy = ServerNetworkStaWifiWorkTime_IsImageSaveInProgress();
                bool final_daily_image_busy =
                    ServerNetworkStaWifiWorkTime_IsDailyImageInProgress();
                TickType_t final_now = xTaskGetTickCount();
                uint32_t final_http_hold_remaining = http_activity_hold_remaining_seconds(final_now);
                uint32_t final_ch583_hold_remaining = ch583_activity_hold_remaining_seconds(final_now);
                uint32_t final_wifi_connect_guard_remaining_ms =
                    ServerNetworkStaWifiWorkTime_GetWifiConnectGuardRemainingMs();
                uint32_t final_elapsed = update_working_time_seconds();
                bool final_factory_reset_guard =
                    __atomic_load_n(&s_factory_reset_guard_active,
                                    __ATOMIC_ACQUIRE);
                bool final_factory_reset_request_changed =
                    !factory_reset_power_cycle_pending &&
                    __atomic_load_n(&s_factory_reset_wake_seconds,
                                    __ATOMIC_ACQUIRE) > 0;
                bool final_timer_active =
                    !factory_reset_power_cycle_pending &&
                    final_elapsed <= server_required_continue_work_time;
                if (factory_reset_power_cycle_pending) {
                    final_http_hold_remaining = 0;
                    final_ch583_hold_remaining = 0;
                }
                if (final_factory_reset_guard ||
                    final_factory_reset_request_changed ||
                    final_timer_active ||
                     final_ota_hold_flags != 0 ||
                     final_epd_busy ||
                     final_image_save_busy ||
                     final_daily_image_busy ||
                     final_http_hold_remaining > 0 ||
                     final_ch583_hold_remaining > 0 ||
                     final_wifi_connect_guard_remaining_ms > 0) {
                    ESP_LOGI(TAG,
                             "power off canceled by final guard factory_reset=%d timer=%d ota=0x%lx epd=%d image_save=%d daily=%d http_remaining=%lu ch583_remaining=%lu wifi_connect_remaining_ms=%lu",
                             (final_factory_reset_guard ||
                              final_factory_reset_request_changed) ? 1 : 0,
                             final_timer_active ? 1 : 0,
                             (unsigned long)final_ota_hold_flags,
                             final_epd_busy ? 1 : 0,
                             final_image_save_busy ? 1 : 0,
                             final_daily_image_busy ? 1 : 0,
                             (unsigned long)final_http_hold_remaining,
                             (unsigned long)final_ch583_hold_remaining,
                             (unsigned long)final_wifi_connect_guard_remaining_ms);
                    if (final_http_hold_remaining > 0) {
                        (void)__atomic_fetch_or(&s_guard_log_flags,
                                                USER_WORK_STATE_GUARD_LOG_HTTP_BIT,
                                                __ATOMIC_ACQ_REL);
                    }
                    if (final_ch583_hold_remaining > 0) {
                        (void)__atomic_fetch_or(&s_guard_log_flags,
                                                USER_WORK_STATE_GUARD_LOG_CH583_BIT,
                                                __ATOMIC_ACQ_REL);
                    }
                    (void)__atomic_fetch_or(&s_runtime_state_flags,
                                            USER_WORK_STATE_RUNTIME_LED_CANCEL_PENDING_BIT,
                                            __ATOMIC_ACQ_REL);
                    if (!retry_pending_led_power_off_cancel()) {
                        ESP_LOGE(TAG, "final guard failed to release LED power-off lock, retry scheduled");
                    }
                    if (!retry_pending_wake_timer_cancel()) {
                        ESP_LOGE(TAG, "final guard failed to cancel CH583 wake timer, retry scheduled");
                    }
                    s_last_power_off_send_tick = 0;
                    vTaskDelay(pdMS_TO_TICKS(USER_WORK_STATE_TASK_INTERVAL_MS));
                    continue;
                }
                esp_err_t spi_lock_ret =
                    TdxSharedSpi_Lock(pdMS_TO_TICKS(WORK_STATE_POWER_OFF_SPI_LOCK_TIMEOUT_MS));
                if (spi_lock_ret != ESP_OK) {
                    ESP_LOGE(TAG,
                             "power off postponed because shared SPI lock failed ret=%s",
                             esp_err_to_name(spi_lock_ret));
                    (void)__atomic_fetch_or(&s_runtime_state_flags,
                                            USER_WORK_STATE_RUNTIME_LED_CANCEL_PENDING_BIT,
                                            __ATOMIC_ACQ_REL);
                    if (!retry_pending_led_power_off_cancel()) {
                        ESP_LOGE(TAG, "SPI lock failure left LED power-off cancellation pending");
                    }
                    if (!retry_pending_wake_timer_cancel()) {
                        ESP_LOGE(TAG, "SPI lock failure left CH583 wake timer rollback pending");
                    }
                    s_last_power_off_send_tick = 0;
                    vTaskDelay(pdMS_TO_TICKS(USER_WORK_STATE_TASK_INTERVAL_MS));
                    continue;
                }

