tdxguiping/ESP32_S3_epaper/main/server_network_sta/wifi_work_time/server_network_sta_wifi_work_time.c
                uint32_t locked_ota_hold_flags =
                    __atomic_load_n(&s_ota_hold_flags, __ATOMIC_ACQUIRE);
                bool locked_epd_busy = ServerNetworkStaEpdDisplay_IsBusy();
                bool locked_image_save_busy =
                    ServerNetworkStaWifiWorkTime_IsImageSaveInProgress();
                bool locked_daily_image_busy =
                    ServerNetworkStaWifiWorkTime_IsDailyImageInProgress();
                TickType_t locked_now = xTaskGetTickCount();
                uint32_t locked_http_hold_remaining =
                    http_activity_hold_remaining_seconds(locked_now);
                uint32_t locked_ch583_hold_remaining =
                    ch583_activity_hold_remaining_seconds(locked_now);
                uint32_t locked_wifi_connect_guard_remaining_ms =
                    ServerNetworkStaWifiWorkTime_GetWifiConnectGuardRemainingMs();
                uint32_t locked_elapsed = update_working_time_seconds();
                bool locked_factory_reset_guard =
                    __atomic_load_n(&s_factory_reset_guard_active,
                                    __ATOMIC_ACQUIRE);
                bool locked_factory_reset_request_changed =
                    !factory_reset_power_cycle_pending &&
                    __atomic_load_n(&s_factory_reset_wake_seconds,
                                    __ATOMIC_ACQUIRE) > 0;
                bool locked_timer_active =
                    !factory_reset_power_cycle_pending &&
                    locked_elapsed <= server_required_continue_work_time;
                if (factory_reset_power_cycle_pending) {
                    locked_http_hold_remaining = 0;
                    locked_ch583_hold_remaining = 0;
                }
                if (locked_factory_reset_guard ||
                    locked_factory_reset_request_changed ||
                    locked_timer_active ||
                     locked_ota_hold_flags != 0 ||
                     locked_epd_busy ||
                     locked_image_save_busy ||
                     locked_daily_image_busy ||
                     locked_http_hold_remaining > 0 ||
                     locked_ch583_hold_remaining > 0 ||
                     locked_wifi_connect_guard_remaining_ms > 0) {
                    ESP_LOGI(TAG,
                             "power off canceled by locked guard factory_reset=%d timer=%d ota=0x%lx epd=%d image_save=%d daily=%d http_remaining=%lu ch583_remaining=%lu wifi_connect_remaining_ms=%lu",
                             (locked_factory_reset_guard ||
                              locked_factory_reset_request_changed) ? 1 : 0,
                             locked_timer_active ? 1 : 0,
                             (unsigned long)locked_ota_hold_flags,
                             locked_epd_busy ? 1 : 0,
                             locked_image_save_busy ? 1 : 0,
                             locked_daily_image_busy ? 1 : 0,
                             (unsigned long)locked_http_hold_remaining,
                             (unsigned long)locked_ch583_hold_remaining,
                             (unsigned long)locked_wifi_connect_guard_remaining_ms);
                    TdxSharedSpi_Unlock();
                    (void)__atomic_fetch_or(&s_runtime_state_flags,
                                            USER_WORK_STATE_RUNTIME_LED_CANCEL_PENDING_BIT,
                                            __ATOMIC_ACQ_REL);
                    if (!retry_pending_led_power_off_cancel()) {
                        ESP_LOGE(TAG, "locked guard failed to release LED power-off lock");
                    }
                    if (!retry_pending_wake_timer_cancel()) {
                        ESP_LOGE(TAG, "locked guard failed to cancel CH583 wake timer");
                    }
                    s_last_power_off_send_tick = 0;
                    vTaskDelay(pdMS_TO_TICKS(USER_WORK_STATE_TASK_INTERVAL_MS));
                    continue;
                }

                int provision_ret =
                    ch583_wifi_uart_send_wifi_provision_mode_before_power_off(
                        EpdDisplayMode_Get());
                if (provision_ret < 0) {
                    // WIFI_PROVISION is an advisory notification. Keep the original
                    // POWER_OFF behavior even when this extra UART write fails.
                    ESP_LOGE(TAG,
                             "pre-power-off WIFI_PROVISION send failed mode=%u ret=%d",
                             (unsigned int)EpdDisplayMode_Get(),
                             provision_ret);
                } else {
                    ESP_LOGI(TAG,
                             "pre-power-off WIFI_PROVISION sent mode=%u(%s)",
                             (unsigned int)EpdDisplayMode_Get(),
                             EpdDisplayMode_ToString(EpdDisplayMode_Get()));
                    vTaskDelay(pdMS_TO_TICKS(100));
                }

                int power_off_ret = ch583_wifi_uart_send_power_off();
                if (power_off_ret < 0) {
                    ESP_LOGE(TAG, "CH583 POWER_OFF UART send failed ret=%d", power_off_ret);
                    if (provision_ret == 0) {
                        int restore_ret =
                            ch583_wifi_uart_send_current_wifi_provision_status();
                        if (restore_ret < 0) {
                            ESP_LOGE(TAG,
                                     "WIFI_PROVISION restore after POWER_OFF failure failed ret=%d",
                                     restore_ret);
                        }
                    }
                    TdxSharedSpi_Unlock();
                    (void)__atomic_fetch_or(&s_runtime_state_flags,
                                            USER_WORK_STATE_RUNTIME_LED_CANCEL_PENDING_BIT,
                                            __ATOMIC_ACQ_REL);
                    if (!retry_pending_led_power_off_cancel()) {
                        ESP_LOGE(TAG, "POWER_OFF failure left LED cancellation pending");
                    }
                    if (!retry_pending_wake_timer_cancel()) {
                        ESP_LOGE(TAG, "POWER_OFF failure left CH583 wake timer rollback pending");
                    }
                } else {
                    if (factory_reset_power_cycle_pending) {
                        __atomic_store_n(&s_factory_reset_wake_seconds,
                                         0,
                                         __ATOMIC_RELEASE);
                    }
                    // The configured wake timer now belongs to the accepted power-off attempt.
                    (void)__atomic_fetch_and(&s_runtime_state_flags,
                                             ~USER_WORK_STATE_RUNTIME_WAKE_TIMER_CANCEL_PENDING_BIT,
                                             __ATOMIC_ACQ_REL);
#if USER_POWER_OFF_LOCAL_EPD_SD_CUTOFF_ENABLE
                    esp_err_t power_ret = ServerNetworkStaEpdDisplay_SetPower(false);
                    if (power_ret != ESP_OK) {
                        ESP_LOGE(TAG,
                                 "POWER_OFF sent but EPD/SD power off failed ret=%s",
                                 esp_err_to_name(power_ret));
                    } else {
                        ESP_LOGI(TAG, "POWER_OFF sent and EPD/SD power switched off");
                    }
#else
                    // CH583 still owns ESP32/WiFi shutdown. Keep GPIO4 high so a rejected
                    // or ineffective POWER_OFF cannot leave the mounted SD/EPD unpowered.
                    ESP_LOGI(TAG, "POWER_OFF sent; keep local EPD/SD power on while waiting for CH583");
#endif

